Revit 2024 API
ScheduleDefinition.ShowGridLines Property
 Indicates if the schedule grid lines will be visible on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.2
Syntax
C#
public bool ShowGridLines { get; set; }
Visual Basic
Public Property ShowGridLines As Boolean
	Get
	Set
Visual C++
public:
property bool ShowGridLines {
	bool get ();
	void set (bool value);
}
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace